dotfiles-bu/emacs/.emacs.d/modules/literate-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-11 Sun 00:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate Org Config</title>
<meta name="author" content="Matthew Fitzsimmons" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Literate Org Config</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org251b18f">1. Org</a>
<ul>
<li><a href="#org164b725">1.1. HTML Export</a>
<ul>
<li><a href="#org6d5ba0e">1.1.1. Htmlize</a></li>
</ul>
</li>
<li><a href="#org3cbb1cf">1.2. Source code block styling</a></li>
<li><a href="#org9a8ba3b">1.3. Enhanced typographical systems</a></li>
<li><a href="#org901b232">1.4. column width</a></li>
<li><a href="#org452fbcb">1.5. poly-org</a></li>
</ul>
</li>
<li><a href="#org9d81b59">2. project</a>
<ul>
<li><a href="#org28eefe3">2.1. joint project + persp selection command</a></li>
</ul>
</li>
<li><a href="#orgba51ff9">3. Sub-file</a>
<ul>
<li><a href="#org7a2ebbe">3.1. Thing</a></li>
</ul>
</li>
<li><a href="#orgd3d812e">4. Provide footer</a></li>
</ul>
</div>
</div>

<div id="outline-container-org251b18f" class="outline-2">
<h2 id="org251b18f"><span class="section-number-2">1.</span> Org</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org164b725" class="outline-3">
<h3 id="org164b725"><span class="section-number-3">1.1.</span> HTML Export</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This file can be exported via the following function:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(org-html-export-to-html)
</pre>
</div>
</div>

<div id="outline-container-org6d5ba0e" class="outline-4">
<h4 id="org6d5ba0e"><span class="section-number-4">1.1.1.</span> Htmlize</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
This packages is required in order for exported html to have syntax highlighting. The colors are taken directly from the current emacs theme.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">htmlize</span>
  <span style="color: #fe8019;">:straight</span> t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3cbb1cf" class="outline-3">
<h3 id="org3cbb1cf"><span class="section-number-3">1.2.</span> Source code block styling</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>We don't want source blocks to be indented</li>
</ul>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">setq</span> org-edit-src-content-indentation 0)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a8ba3b" class="outline-3">
<h3 id="org9a8ba3b"><span class="section-number-3">1.3.</span> Enhanced typographical systems</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This packages allows for the use of prettier “quotation ‘marks’” and proper em—dashes. one simply presses the same key to cycle between options.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">typo</span>
  <span style="color: #fe8019;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org901b232" class="outline-3">
<h3 id="org901b232"><span class="section-number-3">1.4.</span> column width</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A (currently disabled) alternative to olivetti mode, which aligns the text to the left rather than centering.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">visual-fill-column</span>
  <span style="color: #fe8019;">:disabled</span>
  <span style="color: #fe8019;">:straight</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org452fbcb" class="outline-3">
<h3 id="org452fbcb"><span class="section-number-3">1.5.</span> poly-org</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Disabled, as it's impossible to turn on selectively in buffers. Causes problems with faces of org blocks. When enabled it allows to use full language facilities in source blocks.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">poly-org</span>
  <span style="color: #fe8019;">:disabled</span> t
  <span style="color: #fe8019;">:straight</span> t
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9d81b59" class="outline-2">
<h2 id="org9d81b59"><span class="section-number-2">2.</span> project</h2>
<div class="outline-text-2" id="text-2">
<p>
Conveniences for working within and switching between various projects—mainly git repositories.
</p>
</div>

<div id="outline-container-org28eefe3" class="outline-3">
<h3 id="org28eefe3"><span class="section-number-3">2.1.</span> joint project + persp selection command</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">project</span>
  <span style="color: #fe8019;">:config</span>
  (project--read-project-list)
  (<span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">switch-persp-project</span> ()
    (<span style="color: #fb4933;">interactive</span> <span style="color: #b8bb26;">""</span>)
    (<span style="color: #fb4933;">let</span> ((projects project--list))
      (<span style="color: #fb4933;">if</span> projects (<span style="color: #fb4933;">let*</span> ((project
                           (completing-read <span style="color: #b8bb26;">"Project: "</span> projects))
                          (persp-name
                           (file-name-nondirectory (substring project 0 -1))))
                     (persp-switch persp-name)
                     (project-switch-project project))
        (<span style="color: #fb4933; font-weight: bold;">user-error</span> <span style="color: #b8bb26;">"There are no known projects"</span>)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba51ff9" class="outline-2">
<h2 id="orgba51ff9"><span class="section-number-2">3.</span> Sub-file</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7a2ebbe" class="outline-3">
<h3 id="org7a2ebbe"><span class="section-number-3">3.1.</span> Thing</h3>
<div class="outline-text-3" id="text-3-1">
<p>
content
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3d812e" class="outline-2">
<h2 id="orgd3d812e"><span class="section-number-2">4.</span> Provide footer</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #fb4933;">provide</span> '<span style="color: #d3869b;">literate-config</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew Fitzsimmons</p>
<p class="date">Created: 2022-12-11 Sun 00:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
